## Plan Result (user-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11220622583)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
* Delete
  * aws_cloudwatch_log_group.otel-collector-log-group
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.otel-collector-log-group will be destroyed
  # (because aws_cloudwatch_log_group.otel-collector-log-group is not in configuration)
  - resource "aws_cloudwatch_log_group" "otel-collector-log-group" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/Backend/UserAPI-Prod/ecs/otel-collector" -> null
      - id                = "/Backend/UserAPI-Prod/ecs/otel-collector" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/Backend/UserAPI-Prod/ecs/otel-collector" -> null
      - retention_in_days = 90 -> null
      - skip_destroy      = true -> null
      - tags              = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-userapi"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "UserAPI"
        } -> null
      - tags_all          = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-userapi"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "UserAPI"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserAPI-Prod:641" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "app"
                  ~ secrets                = [
                        # (13 unchanged elements hidden)
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/UserAPI/Prod/SENTRY_DSN"
                        },
                      - {
                          - name      = "UNLEASH_ENDPOINT"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/UNLEASH_ENDPOINT"
                        },
                      - {
                          - name      = "UNLEASH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod/UNLEASH_KEY"
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
              - {
                  - environment            = [
                      - {
                          - name  = "DEPLOYMENT_ENVIRONMENT_NAME"
                          - value = "prod"
                        },
                    ]
                  - essential              = true
                  - image                  = "pocket/opentelemetry-collector-contrib"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/UserAPI-Prod/ecs/otel-collector"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "otel-collector"
                  - portMappings           = [
                      - {
                          - containerPort = 4138
                          - hostPort      = 4138
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4137
                          - hostPort      = 4137
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 55681
                          - hostPort      = 55681
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  - secrets                = [
                      - {
                          - name      = "GOOGLE_APPLICATION_CREDENTIALS_JSON"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/GCP_SA_TRACES:::"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "UserAPI-Prod" -> (known after apply)
      ~ revision                 = 641 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-userapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "UserAPI"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77" {
        id               = "arn:aws:iam::996905175585:policy/UserAPI-Prod-TaskExecutionRolePolicy"
        name             = "UserAPI-Prod-TaskExecutionRolePolicy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "secretsmanager:GetSecretValue",
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod/*",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI/Prod",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI-Prod/*",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserAPI-Prod",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/*",
                            "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared",
                            "arn:aws:kms:us-east-1:996905175585:key/fee9bd90-a01f-4212-8b69-9c149a7cdb15",
                        ]
                    },
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:ssm:us-east-1:996905175585:parameter/UserAPI/Prod",
                          - "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/*",
                          - "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "app_code"       = "pocket"
            "component_code" = "pocket-userapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "UserAPI"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
        id               = "arn:aws:iam::996905175585:policy/UserAPI-Prod-TaskRolePolicy"
        name             = "UserAPI-Prod-TaskRolePolicy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                            "logs:PutLogEvents",
                            # (4 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "events:PutEvents"
                        Effect   = "Allow"
                        Resource = "arn:aws:events:us-east-1:996905175585:event-bus/PocketEventBridge-Prod-Shared-Event-Bus"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "app_code"       = "pocket"
            "component_code" = "pocket-userapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "UserAPI"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserAPI-Prod:641" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":797,"Program":"tfcmt","SHA1":"0276b8affc435f578ec2d2cfdd04ab5a0e6af685","Target":"user-api-cdk-production","Vars":{},"WorkflowName":"User API"} -->